--(SSH key - ubuntu)--
$ssh-keygen -b 2048 -t rsa (rsa file path) 
$fold -b -w  70 #(rsa.pub file path)# ==>
$ssh-keygen -E md5 -lf (rsa file path) ==> (check the hash for correction)
$ssh-keygen -f (rsa file path) -l ==>
!
ip ssh pubkey-chain
username admin
key-string (paste the encrypted key id)


----
feature pim
feature interface-vlan
feature hsrp
feature lacp
feature dhcp
feature vpc
feature lldp
feature vtp
clock timezone TRT 3 0


--INTERACTIVE COMMANDS IN CISCO IOS/BASH (KEY PRESS)--
#INTERACTIVE
no username testuser<IQ>[confirm]<R>y
#ENDS_INTERACTIVE


--VTP--
vtp mode server 
vtp domain L3SW
vtp password admin


--DHCP--
ip dhcp excluded-address 10.10.10.0 10.10.10.10
ip dhcp excluded-address 10.10.20.0 10.10.20.10
ip dhcp excluded-address 10.10.30.0 10.10.30.10
!
ip dhcp pool vlan10
 network 10.10.10.0 255.255.255.0
 default-router 10.10.10.1
 dns-server 10.10.10.1
!
ip dhcp pool vlan20
 network 10.10.20.0 255.255.255.0
 default-router 10.10.20.1 
!
ip dhcp pool vlan30
 network 10.10.30.0 255.255.255.0
 default-router 10.10.30.1 
!
service dhcp (interface)
(sh ip dhcp binding)
(sh ip dhcp pool)
!
ip address dhcp (router dhcp client)
ip helper-address 10.0.0.1 (dhcp relay for router. IP = client inbound interace of router)


--HSRP/VPC--
nexus-1/nexus-2 routers

Nexus-1(config)# feature vpc
Nexus-1(config)# feature lacp
Nexus-1(config)# interface mgmt 0 
Nexus-1(config-if)# ip address 10.1.1.1/30 (ip of keep alive link, mgmt0 port)
Nexus-1(config-if)# no shutdown
Nexus-1(config)# vpc domain 1
Nexus-1(config-vpc-domain)# role priority 20
Nexus-1(config-vpc-domain)# peer-keepalive destination 10.1.1.2 source 10.1.1.1 vrf management
Nexus-1(config)# interface ethernet 1/1-2 (interfaces of peer link interface)
Nexus-1(config-if-range)# channel-group 20 mode active
Nexus-1(config-if-range)# no shutdown

Nexus-1(config)# interface port-channel 20
Nexus-1(config-if)# no shutdown
Nexus-1(config-if)# switchport
Nexus-1(config-if)# switchport mode trunk
Nexus-1(config-if)# vpc peer-link
Nexus-1(config)# interface eth 1/3 (interface going to host devices)
Nexus-1(config-if)# channel-group 30 mode active
!
Nexus-1(config-if)# interface port-channel 30
Nexus-1(config-if)# switchport
Nexus-1(config-if)# switchport mode access
Nexus-1(config-if)# switchport access vlan 30
Nexus-1(config-if)# vpc 30
!
!
!
Nexus-2(config)# feature vpc
Nexus-2(config)# feature lacp
Nexus-2(config)# interface mgmt 0
Nexus-2(config-if)# ip address 10.1.1.2/30
Nexus-2(config-if)# no shutdown
Nexus-2(config)# vpc domain 1
Nexus-2(config-vpc-domain)# role priority 30
Nexus-2(config-vpc-domain)# peer-keepalive destination 10.1.1.1 source 10.1.1.2 vrf management
Nexus-2(config-vpc-domain)#
Nexus-2(config)# interface ethernet 1/1-2
Nexus-2(config-if-range)# channel-group 20 mode active
Nexus-2(config-if-range)# no shutdown

Nexus-2(config)# interface port-channel 20
Nexus-2(config-if)# no shut
Nexus-2(config-if)# switchport
Nexus-2(config-if)# switchport mode trunk
Nexus-2(config-if)# vpc peer-link
Nexus-2(config)# interface eth 1/3
Nexus-2(config-if)# channel-group 30 mode active
!
Nexus-2(config-if)# interface port-channel 30
Nexus-2(config-if)# switchport
Nexus-2(config-if)# switchport mode access
Nexus-2(config-if)# switchport access vlan 30
Nexus-2(config-if)# vpc 30


--SSH--
conf t 
hostname L2SW3
ip domain-name L2SW3
username admin privilege 15 secret admin
crypto key generate rsa
1024
ip ssh time-out 30
ip ssh authentication-retries 4
ip ssh ver 2
line vty 0 15
transport input ssh 
login local
exi


--EXTENDED ACL--
ip access-list extended ACL1020
permit ip/ip host [IP] any
deny ip 10.10.10.0 0.0.0.255 10.20.20.0 0.0.0.255 (wildcard)
permit ip host [ip] host [ip]
!
ip access-group ACL1020 in (apply to the interface [vlan/line])


--SECURITY--
enable password admin123.*
!
username admin privilege 15 secret 5 $1$L.G4$wBUM5fWdu9Qn5YOe0D0FH1
username berten privilege 15 secret 5 $1$Xh3X$RcAQJk0hK4yTVG3b2Iilk.
username ifyildiz privilege 15 secret 5 $1$DEt0$MgSsw0Eq5whXtnxO6/fbc/


--NTP_SERVER--
ntp master 1
ntp server 10.10.10.1 version 2


--ERASE CONFIG--
erase startup-config
delete flash:vlan.dat 
reload



